Dolomonti/ESP32s3-Lawnmower/src/main.cpp
// Globale Variablen für die Steuerung
uint16_t global_cmdCode = 0;   
uint16_t global_accel = 10;    
uint16_t global_brake = 100;   
int16_t global_maxSpeedL = 0; // FIX: Deklaration hinzugefügt
int16_t global_maxSpeedR = 0; // FIX: Deklaration hinzugefügt

// pinMode(BLADE_UP_PIN, OUTPUT);
// pinMode(BLADE_DOWN_PIN, OUTPUT);

#include <WiFi.h>
#include <DNSServer.h>
#include <esp_now.h>
#include <HardwareSerial.h>
#include <esp_wifi.h>

#include "I2Cdev.h"
#include "MPU6050_6Axis_MotionApps20.h"
#include "Wire.h"

#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <AsyncWebSocket.h>

#include <ArduinoJson.h>

#include <Preferences.h>  // Phase 1.2: NVS mit Wear-Leveling statt EEPROM
#include <ArduinoOTA.h>
#include "esp_crc.h" // Dies für die CRC32-Berechnung hinzufügen
#include <atomic>    // Phase 2: Thread-sichere atomare Variablen

DNSServer dnsServer;        // <--- DNS Server Instanz
const byte DNS_PORT = 53;

#define ESPNOW_FIXED_CHANNEL 6

#define EEPROM_SIZE 512 // Adjust based on your requirements
// Settings-Struct ist in Config.h, aber Instanz muss hier definiert werden
Settings currentSettings; // Global settings object

// Blade Control Variablen - Enums in Config.h, Instanzen hier
Servo bladeEsc; // Blade ESC Servo object
BladeState currentBladeState = BLADE_OFF;
BladeHeight currentBladeHeight = BLADE_HEIGHT_UNKNOWN;

unsigned long bladeSequenceStartTime = 0;
int current_blade_pwm = BLADE_ZERO_US; 

// State variables for safety logic - atomics in Config.h als extern
int16_t originalMaxSpeed = 0;
bool isHighVoltageShutdown = false;

// Atomische Variablen müssen hier definiert werden (extern in Config.h)
std::atomic<bool> isInSafetyMode{false};
std::atomic<bool> skill8SafetyActive{false};
std::atomic<bool> skillActive{false};
std::atomic<int> currentSkill{0};
std::atomic<bool> hoverboardIsBusy{false};

// Timer for sending status updates to the webpage
unsigned long lastStatusSend = 0;
const long statusSendInterval = 2000; // Send status every 2 seconds


AsyncWebServer server(80); // Define the web server
AsyncWebSocket ws("/ws");  // Define the WebSocket path
char stored_ssid[32] = ""; // Store WiFi SSID
char stored_password[32] = ""; // Store WiFi password
bool isWiFiConnected = false; // WiFi connection status
bool apShutoffInitiated = false; // AP shutdown status
unsigned long apStartTime = 0; // AP start time
uint8_t selfMacAddress[6]; // Declare the MAC address variable
volatile bool shouldRestart = false; // Flag to trigger restart from main loop


// ====================================================================================
// ===== Phase 1.1: Web Serial Puffer - Ringpuffer ohne Heap-Fragmentierung ===========
// ====================================================================================
bool webLogActive = false;               // Schalter: Soll ans Web gesendet werden?

// Ringpuffer für Web-Log (kein String für Heap-Fragmentierung)
// WEB_LOG_BUFFER_SIZE ist in Config.h definiert
char webLogBuffer[WEB_LOG_BUFFER_SIZE];  // Statischer Ringpuffer
volatile size_t webLogWriteIndex = 0;    // Schreibposition
volatile size_t webLogReadIndex = 0;     // Leseposition
volatile bool webLogOverflow = false;    // Overflow-Flag
unsigned long lastWebLogSend = 0;        // Timer für das 0.5s Intervall

// Hilfsfunktion: Fügt Text zum Ringpuffer hinzu (thread-sicher)
void addToWebLogBuffer(const char* msg) {
    if (!msg || !webLogActive) return;
    
    size_t len = strlen(msg);
    if (len == 0) return;
    
    // Prüfen ob genug Platz oder Overflow
    size_t available;
    if (webLogWriteIndex >= webLogReadIndex) {
        available = WEB_LOG_BUFFER_SIZE - (webLogWriteIndex - webLogReadIndex) - 1;
    } else {
        available = webLogReadIndex - webLogWriteIndex - 1;
    }
    
    if (len > available) {
        webLogOverflow = true;
        // Nur soviel schreiben wie Platz ist
        len = available;
    }
    
    // In Ringpuffer schreiben
    for (size_t i = 0; i < len; i++) {
        webLogBuffer[webLogWriteIndex] = msg[i];
        webLogWriteIndex = (webLogWriteIndex + 1) % WEB_LOG_BUFFER_SIZE;
    }
}

// Hilfsfunktion: Holt Text aus Ringpuffer (fürs Senden)
void getFromWebLogBuffer(char* dest, size_t maxLen) {
    if (!dest || maxLen == 0) return;
    
    size_t count = 0;
    while (count < maxLen - 1 && webLogReadIndex != webLogWriteIndex) {
        dest[count] = webLogBuffer[webLogReadIndex];
        webLogReadIndex = (webLogReadIndex + 1) % WEB_LOG_BUFFER_SIZE;
        count++;
    }
    dest[count] = '\0';
    
    // Overflow-Marker hinzufügen falls nötig
    if (webLogOverflow) {
        strncat(dest, "\n--- BUFFER OVERFLOW ---\n", maxLen - strlen(dest) - 1);
        webLogOverflow = false;
    }
}

// Hilfsfunktion: Prüft ob Daten im Puffer
bool webLogHasData() {
    return webLogWriteIndex != webLogReadIndex;
}

// Hilfsfunktion: Puffer leeren
void clearWebLogBuffer() {
    webLogWriteIndex = 0;
    webLogReadIndex = 0;
    webLogOverflow = false;
}

// 1. Ersatz für debugPrint / debugPrintln - mit char Buffer statt String
template <typename T>
void debugPrint(T msg) {
    Serial.print(msg); // Immer an USB senden
}

template <typename T>
void debugPrintln(T msg) {
    Serial.println(msg); // Immer an USB senden
    if (webLogActive) {
        char buf[128];
        snprintf(buf, sizeof(buf), "%s\n", String(msg).c_str());
        addToWebLogBuffer(buf);
    }
}

// Overloads for IPAddress
void debugPrint(const IPAddress &msg) {
    Serial.print(msg);
}

void debugPrintln(const IPAddress &msg) {
    Serial.println(msg);
    if (webLogActive) {
        char buf[64];
        snprintf(buf, sizeof(buf), "%s\n", msg.toString().c_str());
        addToWebLogBuffer(buf);
    }
}

// Overloads für float
void debugPrint(float msg) {
    Serial.print(msg, 2);
}

void debugPrintln(float msg) {
    Serial.println(msg, 2);
    if (webLogActive) {
        char buf[32];
        snprintf(buf, sizeof(buf), "%.2f\n", msg);
        addToWebLogBuffer(buf);
    }
}

// 2. Ersatz für debugPrintf
void debugPrintf(const char *format, ...) {
    char loc_buf[128]; 
    va_list args;
    va_start(args, format);
    vsnprintf(loc_buf, sizeof(loc_buf), format, args);
    va_end(args);

    Serial.print(loc_buf); // Immer an USB
    if (webLogActive) {
        addToWebLogBuffer(loc_buf);
    }
}

// 3. Einfache Log-Funktion ohne String-Klasse
void logToWebpage(const char* message) {
    if (message) {
        ws.textAll(message);
    }
}

