Dolomonti/ESP32s3-Lawnmower/src/main.cpp
//Buffer Synchronization with Mutex: Synchronize shared buffers using a mutex to avoid data corruption
SemaphoreHandle_t bufferMutex = xSemaphoreCreateMutex();
SemaphoreHandle_t feedbackMutex;
// In der Nähe Ihrer anderen Mutex-Deklarationen
SemaphoreHandle_t i2cMutex;



// Example: a function to clear skill states
// *** TASK 3.1: Funktion checkWebSocketConnection() entfernt, direkt ws.cleanupClients() verwenden ***
void readWiFiCredentialsFromNVS() {
    // Phase 1.2: Umstellung auf Preferences (NVS)
    Preferences prefs;
    if (!prefs.begin("wifi", true)) {  // read-only
        stored_ssid[0] = '\0';
        stored_password[0] = '\0';
        return;
    }
    
    // SSID und Passwort aus NVS laden
    String ssid = prefs.getString("ssid", "");
    String password = prefs.getString("password", "");
    prefs.end();
    
    // In globale Buffer kopieren (mit Längenbegrenzung)
    strlcpy(stored_ssid, ssid.c_str(), 32);
    strlcpy(stored_password, password.c_str(), 32);
}


void writeWiFiCredentialsToNVS(const char *ssid, const char *password) {
    // Phase 1.2: Umstellung auf Preferences (NVS)
    Preferences prefs;
    if (!prefs.begin("wifi", false)) {  // read-write
        DEBUG_LOG("ERROR: Failed to open WiFi NVS namespace!");
        logToWebpage("Error: Failed to save WiFi credentials.");
        return;
    }
    
    // Sicherheitsfix: Länge validieren
    size_t ssidLen = strlen(ssid);
    size_t passwordLen = strlen(password);
    if (ssidLen >= 32 || passwordLen >= 32) {
        DEBUG_LOG("WARNING: WiFi credentials truncated (max 31 chars)");
    }
    
    // In NVS speichern
    bool ssidOk = prefs.putString("ssid", ssid);
    bool passOk = prefs.putString("password", password);
    prefs.end();
    
    if (ssidOk && passOk) {
        DEBUG_LOG("WiFi credentials successfully saved to NVS.");
        logToWebpage("WiFi credentials saved.");
    } else {
        DEBUG_LOG("ERROR: Failed to save WiFi credentials to NVS.");
        logToWebpage("Error: Failed to save WiFi credentials.");
    }
}

// ESP-NOW Send Callback (required but unused - no action needed)
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
    // Callback is registered but no action required
    (void)mac_addr; (void)status; // Suppress unused parameter warnings
}


// REVISED PEER MANAGEMENT LOGIC
void managePeers() {
    unsigned long currentMillis = millis();

    if (xSemaphoreTake(espNowMutex, (TickType_t)50) != pdTRUE) {
        return; // Could not get mutex, try again later
    }

    for (int i = 0; i < numberOfPeers; i++) {
        // >>> FIX 1: Skip trying to manage our own MAC address
        if (deviceList[i].id == deviceID) {
            continue;
        }

        // 1. Check for timeout if currently connected
        if (peers[i].isConnected && (currentMillis - peers[i].lastSeen > peerTimeout)) {
            peers[i].isConnected = false;
            peers[i].reconnectAttempts = 0; // Reset attempts on disconnect
            DEBUG_PRINTF("Peer %d timed out.\n", deviceList[i].id);
        }

        // 2. Attempt to reconnect (Status-Update ohne Re-Init)
        if (!peers[i].isConnected) {
            if (currentMillis - peers[i].lastReconnectAttempt > reconnectInterval) {
                peers[i].lastReconnectAttempt = currentMillis;
                // Wir löschen den Peer NICHT mehr. ESP-NOW merkt von selbst,
                // wenn das Gerät wieder in Reichweite ist und sendet.
                if (peers[i].reconnectAttempts == 0) {
                    DEBUG_PRINTF("Peer %d marked as OFFLINE. Waiting for signal...\n", deviceList[i].id);
                    peers[i].reconnectAttempts = 1; // Nur einmal loggen
                }
            }
        }
    }
    xSemaphoreGive(espNowMutex);
}


/**
 * @brief Saves the current settings structure AND a CRC32 checksum to EEPROM.
 */
bool saveSettings() {
    // Phase 1.2: Umstellung auf Preferences (NVS) mit Wear-Leveling
    Preferences prefs;
    
    // 1. Berechne den CRC32 der Einstellungs-Struktur
    uint32_t calculated_crc = esp_crc32_le(0, (uint8_t*)&currentSettings, sizeof(Settings));
    
    // 2. NVS öffnen (Namespace "mower", ReadWrite-Modus)
    if (!prefs.begin("mower", false)) {
        DEBUG_LOG("ERROR: Failed to open NVS namespace!");
        return false;
    }
    
    // 3. Settings als Bytes speichern
    size_t bytesWritten = prefs.putBytes("settings", &currentSettings, sizeof(Settings));
    
    // 4. CRC separat speichern
    prefs.putUInt("crc", calculated_crc);
    
    // 5. NVS schließen
    prefs.end();
    
    // 6. Prüfen ob Speichern erfolgreich
    if (bytesWritten == sizeof(Settings)) {
        DEBUG_LOG("Settings and CRC successfully saved to NVS.");
        return true;
    } else {
        DEBUG_LOG("ERROR: Failed to save settings to NVS!");
        return false;
    }
}
/**
 * @brief Loads settings from EEPROM or initializes with defaults if CRC check fails.
 */

void loadSettings() {
    // Phase 1.2: Umstellung auf Preferences (NVS)
    Preferences prefs;
    
    // 1. NVS öffnen (read-only für Lesezugriff)
    if (!prefs.begin("mower", true)) {
        DEBUG_LOG("ERROR: Failed to open NVS namespace for reading!");
        // Fallback: Defaults laden
    }
    
    // 2. Prüfen ob Settings existieren
    size_t settingsLen = prefs.getBytesLength("settings");
    
    if (settingsLen == sizeof(Settings)) {
        // Settings existieren, laden
        prefs.getBytes("settings", &currentSettings, sizeof(Settings));
        
        // 3. CRC laden und prüfen
        uint32_t saved_crc = prefs.getUInt("crc", 0);
        uint32_t calculated_crc = esp_crc32_le(0, (uint8_t*)&currentSettings, sizeof(Settings));
        
        prefs.end(); // NVS schließen
        
        // 4. CRC und Magic prüfen
        if (calculated_crc == saved_crc && currentSettings.magic == 0xDEADBEEF) {
            DEBUG_LOG("Successfully loaded settings from NVS (CRC OK).");
            return; // Alles OK
        }
    }
    
