Dolomonti/ESP32s3-Lawnmower/src/main.cpp
    // NVS schließen falls noch offen
    prefs.end();
    
    // 5. CRC ungültig oder keine Daten -> Defaults laden
    DEBUG_LOG("NVS data invalid or not found! Loading defaults.");
    
    // *** SICHERHEIT: Struct zurücksetzen vor Default-Zuweisung ***
    memset(&currentSettings, 0, sizeof(Settings));

    // --- Set Default Values --- 
    currentSettings.magic = 0xDEADBEEF; 

    // Drive System Defaults
    currentSettings.driveBatteryFactor = 1.0;
    currentSettings.driveMinShutdownVoltage = 3100;
    currentSettings.driveSafetyModeVoltage = 3250;
    currentSettings.driveHighVoltage = 4300;
    currentSettings.driveEmergencyLowTemp = 200;
    currentSettings.driveSafetyModeTemp = 1000;
    currentSettings.driveHighTemp = 5000;

    // Blade System Defaults
    currentSettings.bladeBatteryFactor = 6.40;
    currentSettings.bladeMinShutdownVoltage = 1200;
    currentSettings.bladeSafetyModeVoltage = 1300;
    currentSettings.bladeHighVoltage = 1680;
    currentSettings.bladeEmergencyLowTemp = 500;
    currentSettings.bladeSafetyModeTemp = 1000;
    currentSettings.bladeHighTemp = 5000;

    // Speed & Steer Defaults
    currentSettings.maxSpeed = MAX_SPEED;
    currentSettings.maxSteer = MAX_STEER;
    currentSettings.currentMaxSpeed = 200;
    currentSettings.currentMaxSteer = 200;

    // Blade Speeds & Reset Timing
    currentSettings.bladeWorkingSpeed = 1600;
    currentSettings.bladeStage2Speed = 1700;
    currentSettings.bladeMaxSpeed = 1800;
    currentSettings.bladeCableResetRpm = 1800;
    currentSettings.bladeResetRampS = 3;      
    currentSettings.bladeResetDurationS = 1;  

    // Capsize Settings
    currentSettings.capsizeAngle = 60.0;
    currentSettings.capsizeTimeout = 1500;

    // PD-Gains
    currentSettings.Kp = 4.0;
    currentSettings.Kd = 1.5;

    currentSettings.apiKey[0] = '\0';

    // Speichere die neuen Standardwerte
    if (!saveSettings()) {
        DEBUG_LOG("ERROR: Failed to save default settings to NVS!");
    }
}


/////////////////////////TRIGGER SKILLS Logic//////////////////////////////////////////////

/////////////////////////TRIGGER SKILLS Logic//////////////////////////////////////////////

// ---------------------------------------------------------------------
// Forward Declarations (für normalizeAngle in Skill 2, 4)
// ---------------------------------------------------------------------
inline float normalizeAngle(float angle);

// ---------------------------------------------------------------------
// Helper Functions (Phase 4b Refactoring)
// ---------------------------------------------------------------------

/**
 * @brief Stoppt das Messer sicher und protokolliert den Grund
 * @param reason Grund für das Stoppen (für Debug-Log)
 */
inline void stopBladeSafely(const char* reason) {
    currentBladeState = BLADE_OFF;
    digitalWrite(BLADE_UNIT_PIN, LOW);
    current_blade_pwm = BLADE_ZERO_US;
    DEBUG_PRINTF("Blade stopped: %s\n", reason);
}

/**
 * @brief Prüft ob das Messer aktiviert werden darf
 * @return true wenn Messer unten (BLADE_HEIGHT_DOWN), sonst false
 */
inline bool bladeAllowed() {
    return (currentBladeHeight == BLADE_HEIGHT_DOWN);
}

// ---------------------------------------------------------------------
// Sub-Handler 1: Drive & Movement Skills (0, 1, 2, 3, 4, 20)
// ---------------------------------------------------------------------
void handleDriveSkills(uint8_t skill, int16_t param1, int16_t param2, int16_t param3, int16_t param4, int16_t param5, int16_t param6) {
    switch (skill) {
        case SKILL_NONE:
            DEBUG_LOG("Skill 0: undefined placeholder.");
            break;
        case SKILL_RESET:
            DEBUG_LOG("Skill 1: Full System Stop & Reset Triggered.");
            resetAll();
            resetHorizon();
            if (skill8SafetyActive) {
                skill8SafetyActive = false;
                DEBUG_LOG("--> Emergency Stop cleared by reset.");
            }
            if (!skill8Active) {
                skill8Active = true;
                DEBUG_LOG("--> Capsize monitoring (Skill 8) reactivated by reset.");
            }
            hoverboardInverted = false;
            break;
        case SKILL_TURN_90:
            if (!skill8Active) { DEBUG_LOG("Skill 2 cannot be activated: Capsize protection (Skill 8) is not active."); break; }
            resetAll(); resetHorizon();
            input_EspNowSpeed = 0;
            skillActive = true; currentCase = 2;
            if (param1 > 0) { targetAngle = TURN_ANGLE_90; turnDirection = 1; DEBUG_LOG("Skill 2: 90-degree turn RIGHT triggered!"); }
            else if (param1 < 0) { targetAngle = -TURN_ANGLE_90; turnDirection = -1; DEBUG_LOG("Skill 2: 90-degree turn LEFT triggered!"); }
            targetAngle = normalizeAngle(targetAngle);
            monitorDirection = true;
            break;
        case SKILL_HOLD_LINE:
            if (!skill8Active) { DEBUG_LOG("Skill 3 cannot be activated: Capsize protection (Skill 8) is not active."); break; }
            if (holdLine) {
                resetAll();
                DEBUG_LOG("Skill 3: Deactivated (no longer holding the line).");
            } else {
                resetAll(); holdLine = true; skillActive = true; currentCase = 3;
                resetHorizon(); startYaw = yaw; case3StartTime = millis();
                DEBUG_LOG("Skill 3: Activated (holding the line).");
            }
            break;
        case SKILL_TURN_180:
            if (!skill8Active) { DEBUG_LOG("Skill 4 cannot be activated: Capsize protection (Skill 8) is not active."); break; }
            resetAll(); resetHorizon();
            input_EspNowSpeed = 0;
            skillActive = true; currentCase = 4;
            if (param1 > 0) { targetAngle = TURN_ANGLE_180; turnDirection = 1; DEBUG_LOG("Skill 4: 180-degree turn RIGHT triggered!"); }
            else if (param1 < 0) { targetAngle = -TURN_ANGLE_180; turnDirection = -1; DEBUG_LOG("Skill 4: 180-degree turn LEFT triggered!"); }
            targetAngle = normalizeAngle(targetAngle);
            monitorDirection = true;
            break;
        case SKILL_DISTANCE_MISSION:
            resetMissionFlags = true;
            input_JoySteer = 0;
            input_JoySpeed = 0;
            input_EspNowSteer = (param1 > 0) ? 100 : (param1 < 0 ? -100 : 0);
            input_EspNowSpeed = (param2 > 0) ? 100 : (param2 < 0 ? -100 : 0);
            global_cmdCode = 0;
            Send(input_EspNowSteer, input_EspNowSpeed);
            vTaskDelay(pdMS_TO_TICKS(50));
            DEBUG_PRINTF(">>> MISSION KICKSTARTED & SET: L:%d R:%d\n", param1, param2);
            input_EspNowSteer = param1;
            input_EspNowSpeed = param2;
            global_maxSpeedL = (param3 > 0) ? param3 : currentSettings.currentMaxSpeed;
            global_maxSpeedR = (param4 > 0) ? param4 : currentSettings.currentMaxSpeed;
            global_accel     = (uint16_t)constrain(param5, 0, 100);
            global_brake     = (uint16_t)constrain(param6, 0, 100);
            global_cmdCode    = 2;
            skill20StartTime  = millis();
            skillActive       = true;
            currentSkill      = 20;
            DEBUG_PRINTF(">>> MISSION: L:%dcm R:%dcm | Spd L:%d R:%d | Acc:%d%% Brk:%d%%\n", param1, param2, global_maxSpeedL, global_maxSpeedR, global_accel, global_brake);
            break;
    }
}

// ---------------------------------------------------------------------
// Sub-Handler 2: Blade & Actuator Skills (5, 6, 10, 11)
// ---------------------------------------------------------------------
void handleBladeSkills(uint8_t skill, int16_t param1, int16_t param2, int16_t param3, int16_t param4) {
    switch (skill) {
        case 5:
            if (param1 > 0) {
                // Blade UP
                digitalWrite(BLADE_DOWN_PIN, LOW);
                digitalWrite(BLADE_UP_PIN, HIGH);
                currentBladeHeight = BLADE_HEIGHT_UP;
                currentBladeState = BLADE_OFF;
                digitalWrite(BLADE_UNIT_PIN, LOW);
                bladeEsc.writeMicroseconds(BLADE_ZERO_US);
                DEBUG_LOG("Skill 5: Blade UP (Pin 35 HIGH) - forcing Blade OFF for safety.");
            } else if (param1 < 0) {
                // Blade DOWN
                digitalWrite(BLADE_UP_PIN, LOW);
                digitalWrite(BLADE_DOWN_PIN, HIGH);
                currentBladeHeight = BLADE_HEIGHT_DOWN;
                DEBUG_LOG("Skill 5: Blade DOWN (Pin 36 HIGH).");
            } else {
                // Stop blade movement
                digitalWrite(BLADE_UP_PIN, LOW);
                digitalWrite(BLADE_DOWN_PIN, LOW);
                DEBUG_LOG("Skill 5: Blade Height STOP (Pins LOW).");
            }
            break;
        case SKILL_BLADE_CONTROL: {
            // Blade control: param1/key determines action
            int16_t key = param1;
            
