Dolomonti/ESP32s3-Lawnmower/src/main.cpp
    delay(100);


    pinMode(LED_BUILTIN, OUTPUT);

    xTaskCreatePinnedToCore(
            core1WiFiTask,
            "WiFiTask",
            10000,
            NULL,
            5,    
            NULL,
            1
        );

    // Initialize ESP-NOW
    if (esp_now_init() != ESP_OK) {
        debugPrintln("Error initializing ESP-NOW");
        return;
    }
    DEBUG_LOG("ESP-NOW Initialized");

    espNowMutex = xSemaphoreCreateMutex();
    if (espNowMutex == NULL) {
        debugPrintln("Failed to create ESP-NOW mutex");
    }


    // Add peers
    esp_now_peer_info_t peerInfo = {};
    for (int i = 0; i < numberOfPeers; i++) {
        const uint8_t *macAddress = deviceList[i].mac;

        memset(&peerInfo, 0, sizeof(peerInfo));
        memcpy(peerInfo.peer_addr, macAddress, 6);
        peerInfo.channel = 6; // 0 means use current channel
        peerInfo.encrypt = false;

        if (esp_now_add_peer(&peerInfo) != ESP_OK) {
            debugPrintf("Failed to add peer %d\n", i);
        } else {
            DEBUG_PRINTF("Added peer %d successfully\n", i);
        }
    }


  pinMode(BUTTON1_PIN, INPUT_PULLUP);
  pinMode(BUTTON2_PIN, INPUT_PULLUP);
  pinMode(BLADE_BATTERY_PIN, INPUT);

  // Serial starten
  HoverSerial.begin(115200, SERIAL_8N1, HOVER_RX_PIN, HOVER_TX_PIN);

  // SOFORT "Ich bin da, bleib stehen" senden, um Timeout-Piepen zu verhindern
  // Wir senden das ein paar Mal, um sicherzugehen, dass der Puffer synchronisiert ist.
  for(int i=0; i<5; i++) {
      Send(0, 0); 
      delay(20);
  }

  i2cMutex = xSemaphoreCreateMutex();
    if (i2cMutex == NULL) {
        debugPrintln("Konnte i2cMutex nicht erstellen!");
    }
    
    feedbackMutex = xSemaphoreCreateMutex();
    if (feedbackMutex == NULL) {
        debugPrintln("Konnte feedbackMutex nicht erstellen!");
    }
    
    mpuSemaphore = xSemaphoreCreateBinary();
    if (mpuSemaphore == NULL) {
        debugPrintln("FATAL: Could not create MPU semaphore!");
    }



      Wire.begin(13, 14); // SDA, SCL for some ESP32 boards
      Wire.setClock(100000); // Setzt I2C auf 100kHz
      Wire.setTimeOut(20); // 20ms Hardware-Timeout für I2C-Hänger

      // ====================================================================================
      // ===== CHANGE START: Robuste MPU-Init-Retry-Schleife (auf 2 Versuche limitiert) ===
      // ====================================================================================

      const int MAX_MPU_ATTEMPTS = 2; // *** WUNSCHGEMÄSS GEÄNDERT: Nur 2 Versuche ***
      int rectangleMpuAttempts = 0;
      bool rectangleMpuInitialized = false; // Flag zur Verfolgung des Erfolgs

    while (rectangleMpuAttempts < MAX_MPU_ATTEMPTS && !rectangleMpuInitialized) {
        rectangleMpuAttempts++;
        DEBUG_PRINTF("Versuche MPU-Initialisierung (Versuch %d/%d)...\n", rectangleMpuAttempts, MAX_MPU_ATTEMPTS);

        mpu.initialize();

        if (!mpu.testConnection()) {
            DEBUG_LOG(" -> MPU6050-Verbindungstest fehlgeschlagen.");
            delay(500); // Warte vor dem nächsten Verbindungsversuch
            continue;   // Springe zur nächsten Schleifeniteration
        }

          // Verbindung OK, versuche nun, die DMP zu initialisieren
          devStatus = mpu.dmpInitialize();
          
        if (devStatus == 0) {
            // ERFOLG!
            mpu.setDMPEnabled(true);
            dmpReady = true;
            packetSize = mpu.dmpGetFIFOPacketSize();
            DEBUG_LOG(" -> MPU6050 DMP erfolgreich initialisiert.");
            pinMode(46, INPUT); // GPIO 46 als Eingang für den INT-Pin
            attachInterrupt(digitalPinToInterrupt(46), dmpDataReady, RISING); // ISR an Pin 46 binden
            mpu.setIntDataReadyEnabled(true); // Dem MPU sagen, dass er den Interrupt-Pin nutzen soll

            rectangleMpuInitialized = true; // Setze Flag, um die Schleife zu verlassen
        } else {
            // DMP-Init fehlgeschlagen
            DEBUG_PRINTF(" -> MPU6050 DMP-Initialisierung fehlgeschlagen mit Code: %d. Wiederhole...\n", devStatus);
            delay(500); // Warte vor dem erneuten Versuch der DMP-Init
        }
    } // Ende der while-Schleife

    // Prüfe nach der Schleife, ob wir endgültig gescheitert sind
    if (!rectangleMpuInitialized) {
        debugPrintln("KRITISCHER FEHLER: MPU6050 konnte nach 2 Versuchen nicht initialisiert werden! MPU-basierte Skills sind deaktiviert.");
    }
    // ====================================================================================
    // ===== CHANGE END: Ende der MPU-Init-Retry-Schleife ================================
    // ====================================================================================

    // ====================================================================================
    // ===== CHANGE START: Initial Horizon Calibration on Startup & Task Creation Order ===
    // ====================================================================================
    if (rectangleMpuInitialized) {
        // Set DMP update rate to 50Hz (1kHz / (1 + 19) = 50Hz)
        // Halbiert die I2C Last, reicht für Kippschutz völlig aus.
        mpu.setRate(19);
        DEBUG_LOG("MPU DMP rate set to 50Hz for I2C relief.");

          // Create and start the MPU task IMMEDIATELY after initialization
          // to ensure the FIFO buffer is being cleared.
          xTaskCreatePinnedToCore(
              mpuReadTask,
              "MPUTask",
              4096,
              NULL,
              0,                    // Priorität erhöht für zuverlässigen Kippschutz
              NULL,
              0                     
          );

          DEBUG_LOG("MPU initialized. Waiting for sensor to stabilize before setting initial horizon...");

          // Give the MPU task time to read stable values.
          vTaskDelay(2000 / portTICK_PERIOD_MS); // Increased delay to 2 seconds
          resetHorizon();
          DEBUG_LOG("Initial horizon set on startup.");
      }
      // ====================================================================================
      // ===== CHANGE END: End of MPU startup logic fixes ===================================
      // ====================================================================================

    // Initialize default skill states

    if (DEFAULT_SKILL1_ACTIVE) {
        triggerSkill(SKILL_RESET); // Skill 1: Reset Gyro Values
    }
    if (DEFAULT_SKILL2_ACTIVE) {
        // Specify direction: 1 for right, -1 for left
        triggerSkill(SKILL_TURN_90, 1); // Skill 2: 90-degree turn right
    }
    if (DEFAULT_SKILL3_ACTIVE) {
        triggerSkill(SKILL_HOLD_LINE); // Skill 3: Hold the Line
    }
    if (DEFAULT_SKILL4_ACTIVE) {
        // Specify direction: 1 for right, -1 for left
        triggerSkill(SKILL_TURN_180, 1); // Skill 4: 180-degree turn right
    }
    if (DEFAULT_SKILL5_ACTIVE) {
        triggerSkill(SKILL_BLADE_LIFT); // Skill 5: Blade Lift
    }
    if (DEFAULT_SKILL6_ACTIVE) {
        // Specify direction: 1 to activate, -1 to deactivate
        triggerSkill(SKILL_BLADE_CONTROL, BLADE_ON_CMD); // Skill 6: Blade On
    }
    if (DEFAULT_SKILL7_ACTIVE) {
        triggerSkill(SKILL_SET_LIMITS); // Skill 7: Max Speed and Steer setting
    }
    if (ENABLE_DEBUG_SERIAL) {
        debugPrintln("Activating default skill: Skill 8 (Capsize Protection).");
    }
    triggerSkill(SKILL_ESTOP, 1); // Force Skill 8 to be active on startup
    if (DEFAULT_SKILL9_ACTIVE) {
        triggerSkill(SKILL_REBOOT); // Skill 9: Reset ESP32
    }



    WiFi.macAddress(selfMacAddress);

      // Print the current device's MAC address for debugging
      if (ENABLE_DEBUG_SERIAL) {
        debugPrintf("ESP32 MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\n",
                      selfMacAddress[0], selfMacAddress[1], selfMacAddress[2],
                      selfMacAddress[3], selfMacAddress[4], selfMacAddress[5]);
      }

