Dolomonti/ESP32s3-Lawnmower/src/main.cpp
            if (skill8SafetyActive) { taskSteer = 0; taskSpeed = 0; }
        }

        // ---------------------------------------------------------
        // 3. DATEN-ÜBERTRAGUNG (Nur wenn im Normalmodus)
        // ---------------------------------------------------------
        if (shouldSend) {
            if (!skillActive || currentSkill != 20) {
                global_cmdCode = 0;
                Send(taskSteer, taskSpeed); 
            }
        }

        vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(30));
    }
} // <--- Diese schließende Klammer hat gefehlt oder war falsch platziert!

void core1WiFiTask(void *parameter) {
    // AP wurde bereits im setup() gestartet. Hier starten wir nur die Server-Dienste.
    DEBUG_LOG("[WiFiTask] Server-Dienste gestartet.");

    ws.onEvent(onWsEvent);
    server.addHandler(&ws);
    server.on("/", HTTP_GET, handleWebpage);
    server.on("/resetDevice", HTTP_GET, resetDevice);
    server.on("/reset_wifi", HTTP_GET, handleResetWifi);

    server.onNotFound([](AsyncWebServerRequest *request) {
        if (WiFi.getMode() & WIFI_MODE_AP) {
            handleWebpage(request); 
        } else {
            request->send(404);
        }
    });

    server.on("/setupWiFi", HTTP_GET, [](AsyncWebServerRequest *request){
        String ssid, password;
        if (request->hasParam("ssid") && request->hasParam("password")) {
            ssid = request->getParam("ssid")->value();
            password = request->getParam("password")->value();
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintln("Received new WiFi credentials via AP:");
                debugPrintln(ssid);
            }
            writeWiFiCredentialsToNVS(ssid.c_str(), password.c_str());
            request->send(200, "text/plain", "WiFi credentials received. Device is restarting...");
            logToWebpage("WiFi credentials saved. Restarting device to connect...");
            shouldRestart = true;
        } else {
            request->send(400, "text/plain", "Missing SSID or password.");
        }
    });

    server.on("/command", HTTP_GET, [](AsyncWebServerRequest *request) {
        if (request->hasParam("cmd") && request->hasParam("peer")) {
            request->send(200, "text/plain", "Command received");
        } else {
            request->send(400, "text/plain", "Invalid request.");
        }
    });

    server.begin(); 

    // 2. Die optimierte Endlosschleife
    while (true) {
        unsigned long now = millis();

        // --- NEU: LED BLINKEN (aus loop verschoben) ---
        digitalWrite(LED_BUILTIN, (now % 2000) < 1000);

        // --- NEU: AP-TIMEOUT LOGIK (aus loop verschoben) ---
        // Wenn mit Haus-WLAN verbunden, schalte eigenen AP nach 5 Min aus
        if (WiFi.status() == WL_CONNECTED && !apShutoffInitiated) {
            if (now - apStartTime >= 300000) { 
                WiFi.softAPdisconnect(true);
                apShutoffInitiated = true;
                
                // Kanal 6 fixieren für ESP-NOW Stabilität
                esp_wifi_set_promiscuous(true);
                esp_wifi_set_channel(ESPNOW_FIXED_CHANNEL, WIFI_SECOND_CHAN_NONE);
                esp_wifi_set_promiscuous(false);

                DEBUG_LOG("AP shut off - Channel locked to 6.");
            }
        }

        // --- NEU: RECONNECT LOGIK (aus loop verschoben) ---
        if (WiFi.status() != WL_CONNECTED && apShutoffInitiated) {
            setupWiFiAP();
            apShutoffInitiated = false;
        }

        // --- DNS & WEBSOCKET (dein originaler Code) ---
        if (WiFi.getMode() & WIFI_MODE_AP) {
            dnsServer.processNextRequest(); 
        }
        
        ws.cleanupClients();  
        vTaskDelay(100 / portTICK_PERIOD_MS); 
    }
}

// ====================================================================================
// ===== CHANGE START: Updated WebSocket Event Handler to process joystick and command 14 data =====
// ====================================================================================
void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len) {
    if (type == WS_EVT_CONNECT) {
        DEBUG_LOG("WebSocket client connected");
        client->text("Welcome to ESP32 WebSocket!");
        
        // Send settings including API Key
        DynamicJsonDocument doc(1024);
        doc["type"] = "settings";
        doc["apiKey"] = currentSettings.apiKey;
        String output;
        serializeJson(doc, output);
        client->text(output);

    } else if (type == WS_EVT_DISCONNECT) {
        DEBUG_LOG("WebSocket client disconnected");
    } else if (type == WS_EVT_DATA) {
        // Fixed-size buffer to prevent stack overflow (was: char message[len + 1])
        constexpr size_t MAX_WS_MSG_SIZE = 512;
        char message[MAX_WS_MSG_SIZE];
        size_t copyLen = (len < MAX_WS_MSG_SIZE - 1) ? len : MAX_WS_MSG_SIZE - 1;
        memcpy(message, data, copyLen);
        message[copyLen] = '\0';

        if (len >= MAX_WS_MSG_SIZE) {
            debugPrintln("WebSocket message truncated (too large)");
        }
        
        // *** TASK 1.2: static entfernt (Memory Corruption Fix) ***
        DynamicJsonDocument doc(512); 
        DeserializationError error = deserializeJson(doc, message);
        
        if (error) {
            debugPrint(F("deserializeJson() failed: "));
            debugPrintln(error.c_str());
            return;
        }

        if (!doc["type"].isNull()) {
            const char* msgType = doc["type"];

            // --- SAVE API KEY ---
            if (strcmp(msgType, "saveApiKey") == 0) {
                 if (doc.containsKey("apiKey")) {
                     String newKey = doc["apiKey"].as<String>();
                     if (newKey.length() < 64) {
                         strlcpy(currentSettings.apiKey, newKey.c_str(), sizeof(currentSettings.apiKey));
                         settingsNeedSave = true; // Async speichern im eepromSaveTask
                         client->text("LOG: API Key wird gespeichert...");
                     } else {
                         client->text("LOG: Error - API Key too long.");
                     }
                 }
                 return;
            }

            // --- 1. BLOCK: KOMMANDOS ---
            if (strcmp(msgType, "command") == 0) {
                JsonObject dataObj = doc["data"];
                uint16_t rectangleCode = dataObj["code"] | 0; 

                // --- NEU: Live Log Toggle (Code 998) ---
                if (rectangleCode == 998) {
                    int val = dataObj["value"] | 0;
                    webLogActive = (val == 1);
                    if (webLogActive) {
                        client->text("LOG: --- Live Log ACTIVATED ---");
                        clearWebLogBuffer(); // Phase 1.1: Puffer leeren beim Start
                    } else {
                        client->text("LOG: --- Live Log DEACTIVATED ---");
                    }
                    return; // Wichtig: Hier abbrechen
                }

                // WEB-SERIAL INTERFACE (CODE 999)
                if (rectangleCode == 999) {
                    String webCmd = dataObj["value"].as<String>();
                    webCmd.trim();
                    
