Dolomonti/ESP32s3-Lawnmower/src/main.cpp
                    // Wandelt Leerzeichen in Kommas um für einheitliches Parsing
                    webCmd.replace(' ', ','); 

                    bool isValid = false;

                    if (webCmd.indexOf(',') != -1) {
                        int commaIndex = webCmd.indexOf(',');
                        String cmdPart = webCmd.substring(0, commaIndex);
                        String paramPart = webCmd.substring(commaIndex + 1);
                        
                        cmdPart.trim();
                        paramPart.trim();

                        int cmdInt = cmdPart.toInt(); 

                        if (cmdInt == 16 && isValidInteger(paramPart)) {
                            triggerSkill(16, paramPart.toInt());
                            isValid = true;
                        }
                        else if (cmdInt == 17 && isValidInteger(paramPart)) {
                            triggerSkill(17, paramPart.toInt());
                            isValid = true;
                        }
                        else if (cmdInt == 7 && paramPart.indexOf(',') != -1) {
                            int secondComma = paramPart.indexOf(',');
                            String sSpeed = paramPart.substring(0, secondComma);
                            String sSteer = paramPart.substring(secondComma + 1);
                            
                            if (isValidInteger(sSpeed) && isValidInteger(sSteer)) {
                                triggerSkill(7, 0, sSteer.toInt(), sSpeed.toInt());
                                isValid = true;
                            }
                        }
                        // FIX: Erkennt Code 2 oder 20 und verarbeitet bis zu 6 Argumente
                        else if ((cmdInt == 20 || cmdInt == 2)) {
                            int args[6] = {0, 0, 0, 0, 20, 20}; // Standard 20% Accel/Brake falls nicht angegeben
                            int argCount = 0;
                            String currentString = paramPart;

                            while (currentString.length() > 0 && argCount < 6) {
                                int commaPos = currentString.indexOf(',');
                                String valStr = (commaPos != -1) ? currentString.substring(0, commaPos) : currentString;
                                valStr.trim();
                                if (isValidInteger(valStr)) args[argCount++] = valStr.toInt();
                                currentString = (commaPos != -1) ? currentString.substring(commaPos + 1) : "";
                            }
                            
                            if (argCount >= 2) {
                                // Mappe Parameter: L, R, SpeedL, SpeedR, Accel%, Brake%
                                triggerSkill(20, args[0], args[1], args[2], args[3], args[4], args[5]);
                                isValid = true;
                            }
                        }
                        else if (isValidInteger(cmdPart) && isValidInteger(paramPart)) {
                            Send(cmdInt, paramPart.toInt());
                            isValid = true;
                        }
                    }
                    else if (webCmd.length() > 0 && isValidInteger(webCmd)) {
                        triggerSkill(webCmd.toInt());
                        isValid = true;
                    }

                    if (isValid) client->text("CMD: 999 Val:" + webCmd + " [OK]");
                    else client->text("CMD: 999 Val:" + webCmd + " [INVALID]");
                    return; 
                }

                // REGULÄRE SKILLS
                if (rectangleCode == 7) {
                    triggerSkill(7, 0, dataObj["steer"] | 0, dataObj["speed"] | 0);
                }
                else if (rectangleCode == 10) { 
                    triggerSkill(10, dataObj["working"] | 0, dataObj["stage2"] | 0, dataObj["max"] | 0, dataObj["reset"] | 0); 
                }
                else if (rectangleCode == 11) { 
                    triggerSkill(11, dataObj["value"] | 0);
                }
                else if (rectangleCode == 12 || rectangleCode == 13) { 
                    triggerSkill(rectangleCode, dataObj["shutdown"] | 0, dataObj["safety"] | 0, dataObj["high"] | 0, dataObj["low_temp"] | 0, dataObj["safety_temp"] | 0, dataObj["high_temp"] | 0);
                }
                else if (rectangleCode == 14) { 
                    triggerSkill(14, dataObj["angle"] | 45, dataObj["timeout"] | 750);
                }
                else if (rectangleCode == 15) { 
                    triggerSkill(15, dataObj["p1"] | 0, dataObj["p2"] | 0);
                }
                else if (rectangleCode == 19) {
                    // Format: {"type":"command", "data":{"code":19, "cmd":0, "acc":20, "brk":20}}
                    triggerSkill(19, dataObj["cmd"] | 0, dataObj["acc"] | 20, dataObj["brk"] | 20);
                }
                else if (rectangleCode == 20) { 
                    // Format: {"type":"command", "data":{"code":20, "L":50, "R":50}}
                    triggerSkill(20, dataObj["L"] | 0, dataObj["R"] | 0);
                }
                else if (rectangleCode >= 1 && rectangleCode <= 9) {
                    triggerSkill(rectangleCode, (int16_t)(dataObj["value"] | 0)); 
                }
                else {
                    client->text("ERR: Unknown Code");
                    return;
                }

                // Echo für alle regulären Skills
                String echo = "CMD: " + String(rectangleCode);
                if (!dataObj["value"].isNull()) echo += " Val:" + dataObj["value"].as<String>();
                client->text(echo + " [OK]"); 
            } 

            // --- 2. BLOCK: JOYSTICK (Sauber getrennt durch else if) ---
            else if (strcmp(msgType, "joystick") == 0) {
                if (!doc["steer"].isNull() && !doc["speed"].isNull()) {
                    
                    // --- SAFETY FIX: Sofortiger Reset auf Manuellen Modus ---
                    if (skillActive || global_cmdCode != 0) {
                        skillActive = false;       // Beendet laufende Skills (z.B. Skill 20)
                        currentSkill = 0;
                        currentCase = 0;
                        global_cmdCode = 0;        // WICHTIG: Setzt Hoverboard auf "Speed-Mode" (0) zurück
                        DEBUG_LOG("Joystick Moved -> Forced Manual Mode (Cmd 0)");
                    }
                    // -------------------------------------------------------

                    // *** TASK 2.1: Limitierung (Constrain) für Web-Joystick ***
                    int16_t rawSteer = doc["steer"].as<int16_t>();
                    int16_t rawSpeed = doc["speed"].as<int16_t>();
                    
                    input_EspNowSteer = constrain(rawSteer, -currentSettings.currentMaxSteer, currentSettings.currentMaxSteer);
                    input_EspNowSpeed = constrain(rawSpeed, -currentSettings.currentMaxSpeed, currentSettings.currentMaxSpeed);
                    input_JoySteer = input_EspNowSteer;
                    input_JoySpeed = input_EspNowSpeed;
                    lastJoystickCommandTime = millis();
                    if (ENABLE_DEBUG_SERIAL) {
                        debugPrintf("Joystick: Steer %d, Speed %d\n", input_EspNowSteer, input_EspNowSpeed);
                    }
            }
            }
            else {
                DEBUG_PRINTF("Unknown WS type: %s\n", msgType);
            }
        } 
    } 
}
// ====================================================================================
// ===== CHANGE END: End of updated WebSocket Event Handler ===========================
// ====================================================================================


void espNowTask(void *pvParameters) {
  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(onDataReceive);

  while (true) {
    vTaskDelay(10 / portTICK_PERIOD_MS);
  }
}

