Dolomonti/ESP32s3-Lawnmower/src/main.cpp
// ========================================================
//          Wi-Fi Connection
// ========================================================
void connectToWiFi(const char* ssid, const char* password) {
    int maxRetries = 3;
    int retryCount = 0;
    unsigned long retryDelay = 5000;
    bool connected = false;

    while (retryCount < maxRetries && !connected) {
        if (ENABLE_DEBUG_SERIAL) {
          debugPrint("Connecting to ");
          debugPrintln(ssid);
        }
        { char buf[64]; snprintf(buf, sizeof(buf), "Connecting to %s", ssid); logToWebpage(buf); }

        // Phase 3: DHCP statt statischer IP (für flexible Netzwerk-Kompatibilität)
        // WiFi.config() entfernt - DHCP wird automatisch verwendet
        WiFi.begin(ssid, password);
        unsigned long startAttemptTime = millis();

        while (WiFi.status() != WL_CONNECTED && millis() - startAttemptTime < 10000) {
            vTaskDelay(500 / portTICK_PERIOD_MS);
            if (ENABLE_DEBUG_SERIAL) {
              debugPrint(".");
            }
        }


        if (WiFi.status() == WL_CONNECTED) {
            if (ENABLE_DEBUG_SERIAL) {
              debugPrintln("Connected successfully!");
              debugPrint("IP address: ");
              debugPrintln(WiFi.localIP());
            }
            logToWebpage("Connected successfully!");
            { char buf[64]; snprintf(buf, sizeof(buf), "IP address: %s", WiFi.localIP().toString().c_str()); logToWebpage(buf); }
            isWiFiConnected = true;
            apStartTime = millis();
            connected = true;
        } else {
            retryCount++;
            debugPrintln("Failed to connect. Retrying...");
            { char buf[128]; snprintf(buf, sizeof(buf), "Failed to connect. Retrying... (%d/%d)", retryCount, maxRetries); logToWebpage(buf); }
            delay(retryDelay);
        }
    }

    if (!connected) {
        debugPrintln("Failed to connect after multiple attempts.");
        logToWebpage("Failed to connect after multiple attempts.");
    }
}


// ========================================================
// WebSocket Log Function
// ========================================================
// This function sends log messages to all connected WebSocket clients.
// It is used to mirror the ESP32 serial monitor output to the webpage.


// Add logic here for what should happen when the resetDevice function is triggered
void resetDevice(AsyncWebServerRequest *request) {
    if (ENABLE_DEBUG_SERIAL) {
      debugPrintln("Resetting device...");
    }
    logToWebpage("Resetting device...");
    request->send(200, "text/plain", "Device is restarting.");
    // *** TASK 1.3: Blockierenden Code durch Flag ersetzt ***
    shouldRestart = true;
}

// Add this new function to handle the WiFi reset request
void handleResetWifi(AsyncWebServerRequest *request) {
    if (ENABLE_DEBUG_SERIAL) {
      debugPrintln("Resetting WiFi credentials in EEPROM...");
    }
    logToWebpage("Resetting WiFi credentials in EEPROM...");
    // Write empty strings to the credential memory locations
    writeWiFiCredentialsToNVS("", "");
    request->send(200, "text/plain", "WiFi credentials reset. Please restart the device.");
    logToWebpage("WiFi credentials have been reset on the device. A restart is required to apply the changes.");
}


// ====================================================================================
// ===== AFTER: Optimierte Receive Funktion mit Flag-Check & Erweitertem Debug ========
// ====================================================================================
void Receive() {
  while (HoverSerial.available()) {
    incomingByte = HoverSerial.read();
    bufStartFrame = ((uint16_t)(incomingByte) << 8) | incomingBytePrev;

    if (bufStartFrame == START_FRAME) { // Benutze das definierte START_FRAME (0xABCD)
      p = (byte *)&NewFeedback;
      *p++ = incomingBytePrev;
      *p++ = incomingByte;
      idx = 2;
    } 
    else if (idx >= 2 && idx < sizeof(SerialFeedback)) {
      *p++ = incomingByte;
      idx++;
    }

    if (idx == sizeof(SerialFeedback)) {
      // Prüfsumme berechnen (XOR-Kette synchron zur Hoverboard-Firmware)
      uint16_t calcChecksum = (uint16_t)(NewFeedback.start ^ 
                                         NewFeedback.cmd1 ^ 
                                         NewFeedback.cmd2 ^ 
                                         NewFeedback.speedR_meas ^ 
                                         NewFeedback.speedL_meas ^ 
                                         NewFeedback.batVoltage ^ 
                                         NewFeedback.boardTemp ^ 
                                         NewFeedback.cmdLed);

      if (calcChecksum == NewFeedback.checksum) {
        if (xSemaphoreTake(feedbackMutex, (TickType_t)5) == pdTRUE) {
            memcpy(&Feedback, &NewFeedback, sizeof(SerialFeedback));
            xSemaphoreGive(feedbackMutex);
        }

        // 1. BUSY FLAG EXTRAHIEREN (Bit 8: Meldet der STM32 'dist_mode_active'?)
        hoverboardIsBusy = (Feedback.cmdLed & 0x0100) != 0;

        // 2. DATEN-INTERPRETATION: 
        // Wenn Busy (Mission): cmd1/cmd2 sind gefahrene Ticks
        // Wenn Idle: cmd1/cmd2 sind die aktuell gemessenen Geschwindigkeiten/PWM
        if (hoverboardIsBusy) {
          feedbackDistL = Feedback.cmd1;
          feedbackDistR = Feedback.cmd2;
        } else {
          // Nur nullen, wenn keine Mission aktiv ist
          if (currentSkill != 20) {
            feedbackDistL = 0;
            feedbackDistR = 0;
          }
        }
      }
      idx = 0; // Reset für nächstes Paket
    }
    incomingBytePrev = incomingByte; 
  }

  // Debug Ausgabe: Erweitert um den Status der Busy-Flag und die Ticks
  if (PRINT_FEEDBACK_BLOCK) {
    debugPrintf("FB: V=%d | L_Val=%d | R_Val=%d | T=%d | BUSY=%s\n", 
                Feedback.batVoltage, 
                Feedback.cmd1, 
                Feedback.cmd2, 
                Feedback.boardTemp,
                hoverboardIsBusy ? "YES" : "NO");
  }
}

// ########################## LOOP ##########################

void loop(void)
{
    // 1. System-Neustart (falls über Web getriggert)
    if (shouldRestart) {
        delay(100);
        ESP.restart();
    }

    // 2. Daten vom Hoverboard empfangen
    Receive();

    // 3. Sicherheits-Checks & Status-Berechnung
    // Batteriespannung korrigieren (expliziter Cast für Typensicherheit)
    corrected_batVoltage = (int16_t)(Feedback.batVoltage * currentSettings.driveBatteryFactor);

    // Board-Temperatur mit Offset berechnen
    float rectangleCorrectedBoardTemp = Feedback.boardTemp + 37.6f;

