Dolomonti/ESP32s3-Lawnmower/src/main.cpp
    // Systemstatus prüfen (Spannung/Temp Limits) - Phase 3: Removed unused params
    handleSystemStatus(corrected_batVoltage, rectangleCorrectedBoardTemp);

    // 4. ESP-NOW & Peer Management
    managePeers();

    // 5. Konsolen-Eingaben (USB) verarbeiten
    handleSerialInput();

    // 6. & 7. Fahrlogik & Hoverboard-Send
    // Diese Logik wurde vollständig in die 'controlLogicTask' auf Core 1 ausgelagert.
    // Das garantiert ein stabiles 30ms Sende-Intervall, unabhängig von der CPU-Last.
    
    // Wir aktualisieren hier nur noch die Variablen für die Web-Anzeige
    // 8. Web Log Timer (Log-Daten an Website schicken alle 500ms)
        if (webLogActive && (millis() - lastWebLogSend > 500)) {        lastWebLogSend = millis();
        if (webLogHasData()) {
            // Phase 1.1: Ringpuffer auslesen und senden
            char logOutput[WEB_LOG_BUFFER_SIZE];
            getFromWebLogBuffer(logOutput, sizeof(logOutput));
            if (strlen(logOutput) > 0) {
                char prefixed[WEB_LOG_BUFFER_SIZE + 10];
                snprintf(prefixed, sizeof(prefixed), "LOG:%s", logOutput);
                ws.textAll(prefixed);
            } 
        }
    }

    // 9. Mähwerk-Logik (Blade)
    runBladeLogic();

    ArduinoOTA.handle(); // Prüft ständig, ob ein neues Update über WLAN reinkommt

    // 10. Kurze Pause für Hintergrundprozesse
    vTaskDelay(10 / portTICK_PERIOD_MS);
}

void mpuReadTask(void *parameter) {
  DEBUG_LOG("MPU Reading Task (Core 0) started.");
  
  for (;;) {
    // Erhöhter Timeout für Semaphore, um auf ISR zu warten
    if (xSemaphoreTake(mpuSemaphore, pdMS_TO_TICKS(100)) == pdTRUE) {
      if (xSemaphoreTake(i2cMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        
        fifoCount = mpu.getFIFOCount();
        
        // Wenn der Puffer zu voll wird (> 500 Bytes), ist er "veraltet". 
        // Wir löschen ihn komplett für frische Daten.
        if (fifoCount == 1024 || fifoCount > 500) {
          mpu.resetFIFO();
        } 
        else {
          // Wir lesen nur das aktuellste Paket und verwerfen den Rest im Puffer schnell,
          // um Latenz zu vermeiden (Real-Time Orientierung).
          while (fifoCount >= packetSize) {
            mpu.getFIFOBytes(fifoBuffer, packetSize);
            fifoCount -= packetSize;
          }

          // Nur das letzte (aktuellste) Paket verarbeiten
          mpu.dmpGetQuaternion(&q, fifoBuffer);
          mpu.dmpGetGravity(&gravity, &q);
          mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);

          yaw   = 2.0f * ((ypr[0] * 180 / M_PI) - yawOffset);
          pitch = (ypr[1] * 180 / M_PI) - pitchOffset;
          roll  = (ypr[2] * 180 / M_PI) - rollOffset;

          if (yaw > 180)  yaw -= 360;
          if (yaw < -180) yaw += 360;

          if (skill8Active) {
              monitorSkill8Angles(pitch, roll);
              if (monitorDirection) monitorDirectionChange(yaw);
              if (holdLine && (millis() - case3StartTime >= 500)) holdTheLine(yaw);
          }
        }
        xSemaphoreGive(i2cMutex);
      }
    }
    // Task-Delay reduzieren für schnellere Reaktion (Core 0 hat Zeit)
    vTaskDelay(pdMS_TO_TICKS(5)); 
  } 
}


// ========================================================
void handleSystemStatus(int16_t battery, int16_t temp) {

    static unsigned long driveHighVoltTime = 0;
    static unsigned long driveLowVoltTime = 0;
    static unsigned long driveTempErrorTime = 0;
    static unsigned long bladeVoltErrorTime = 0;

    unsigned long now = millis();

    // 1. DRIVE SYSTEM MONITORING (Hoverboard)
    if (battery > 0) {
        // A. Überspannung Drive
        if (battery > currentSettings.driveHighVoltage) {
            if (driveHighVoltTime == 0) driveHighVoltTime = now;
            if (now - driveHighVoltTime > SAFETY_TRIGGER_DELAY && !isHighVoltageShutdown) {
                isHighVoltageShutdown = true;
                debugPrintln("!!! SHUTDOWN: Drive High Voltage (Persistent)!");
                triggerSkill(8, 20);
            }
        } else { driveHighVoltTime = 0; }

        // B. Kritische Unterspannung Drive
        if (battery < currentSettings.driveMinShutdownVoltage) {
            if (driveLowVoltTime == 0) driveLowVoltTime = now;
            if (now - driveLowVoltTime > SAFETY_TRIGGER_DELAY) {
                Send(0, 0);
                debugPrintln("!!! STOP: Drive Battery Critically Low!");
            }
        } else { driveLowVoltTime = 0; }

        // C. Safety Mode (Warnung/Drosselung - ohne Delay für sofortige Reaktion)
        if (battery < currentSettings.driveSafetyModeVoltage && battery >= currentSettings.driveMinShutdownVoltage) {
            if (!isInSafetyMode) {
                isInSafetyMode = true;
                originalMaxSpeed = currentSettings.currentMaxSpeed;
                currentSettings.currentMaxSpeed /= 2;
                triggerSkill(6, -1);
                debugPrintln("!! SAFETY MODE: Low Drive Battery - Blade OFF");
            }
        } else if (battery >= currentSettings.driveSafetyModeVoltage && isInSafetyMode) {
            // Automatischer Reset des Safety Modes, wenn Spannung wieder OK
            isInSafetyMode = false;
            currentSettings.currentMaxSpeed = originalMaxSpeed;
            debugPrintln("SYSTEM: Drive Voltage restored. Normal speed.");
        }
    }

    // 2. DRIVE TEMPERATURE CHECK
    if (temp > -100) { 
        if (temp > currentSettings.driveHighTemp || (temp != 0 && temp < currentSettings.driveEmergencyLowTemp)) {
            if (driveTempErrorTime == 0) driveTempErrorTime = now;
            if (now - driveTempErrorTime > SAFETY_TRIGGER_DELAY) {
                debugPrintf("!!! SHUTDOWN: Drive Temp Error Persistent: %d\n", temp);
                triggerSkill(8, 20);
            }
        } else { driveTempErrorTime = 0; }
    }

    // 3. BLADE SYSTEM MONITORING (Zusatz-Akku) - Integriert in handleSystemStatus
    if (global_blade_voltage_mv > 5000) { 
        int32_t minLimitMv = (int32_t)currentSettings.bladeMinShutdownVoltage * 10;
        int32_t maxLimitMv = (int32_t)currentSettings.bladeHighVoltage * 10;

