Dolomonti/ESP32s3-Lawnmower/src/main.cpp
        if (global_blade_voltage_mv < minLimitMv || global_blade_voltage_mv > maxLimitMv) {
            if (bladeVoltErrorTime == 0) bladeVoltErrorTime = now;
            if (now - bladeVoltErrorTime > SAFETY_TRIGGER_DELAY && currentBladeState != BLADE_OFF) {
                debugPrintf("!!! BLADE STOP: Voltage %d mV Persistent Error! Relay OFF.\n", global_blade_voltage_mv);
                triggerSkill(6, -1);
            }
        } else { bladeVoltErrorTime = 0; }
    }
}

void resetHorizon() {
    yawOffset = ypr[0] * 180 / M_PI;
    pitchOffset = ypr[1] * 180 / M_PI;
    rollOffset = ypr[2] * 180 / M_PI;
    // ====================================================================================
    // ===== CHANGE START: Added capsize timer reset to horizon calibration =============
    // ====================================================================================
    capsizeDetectTime = 0; // Also reset the capsize detection timer to prevent false triggers after reset
    // ====================================================================================
    // ===== CHANGE END: End of timer reset =============================================
    // ====================================================================================
    DEBUG_LOG("Horizon reset: All angles set to 0°.");
}

void resetAll() {
    currentCase = 0;
    monitorDirection = false;
    holdLine = false;
    turnDirection = 0;
    skillActive = false;
    currentSkill = 0;
    skillSteer = 0;
    input_EspNowSpeed = 0;
    input_EspNowSteer = 0;
    capsizeDetectTime = 0;
    lastError = 0.0f;
    lastPdTime = 0;

    // Blade Unit auf Stand-by (1500)
    digitalWrite(BLADE_UNIT_PIN, HIGH); 
    currentBladeState = BLADE_WORK;
    current_blade_pwm = BLADE_ZERO_US;

    DEBUG_LOG("System reset: All states cleared.");
}

// ====================================================================================
// ===== PHASE 3 REFACTORING: Helper Functions ========================================
// ====================================================================================

/**
 * @brief Normalizes an angle to the range [-180, 180] degrees.
 * @param angle The input angle in degrees
 * @return The normalized angle in range [-180, 180]
 */
inline float normalizeAngle(float angle) {
    while (angle > 180.0f) angle -= 360.0f;
    while (angle < -180.0f) angle += 360.0f;
    return angle;
}

/**
 * @brief Calculates the shortest angular difference between two angles.
 * @param from Start angle in degrees
 * @param to Target angle in degrees
 * @return The signed difference in range [-180, 180]
 */
inline float angleDifference(float from, float to) {
    float diff = to - from;
    return normalizeAngle(diff);
}

/**
 * @brief PD-Controller calculation for steering correction.
 * Extracted from monitorDirectionChange and holdTheLine (Phase 3.1).
 *
 * @param error The current error value (deviation from target)
 * @param Kp Proportional gain
 * @param Kd Derivative gain
 * @param maxSteer Maximum steering output limit
 * @return The calculated steering value, constrained to [-maxSteer, maxSteer]
 */
int16_t calculatePDSteer(float error, float Kp, float Kd, int16_t maxSteer) {
    unsigned long now = millis();
    unsigned long timeDelta = now - lastPdTime;

    // Prevent division by zero (thread-safe with < 1)
    if (lastPdTime == 0 || timeDelta < 1) {
        timeDelta = 1;
    }

    // Calculate derivative (rate of error change)
    float derivative = (error - lastError) / (float)timeDelta;

    // PD output
    float pdOutput = (Kp * error) + (Kd * derivative);

    // Store state for next iteration
    lastError = error;
    lastPdTime = now;

    // Constrain and return
    return constrain((int16_t)pdOutput, -maxSteer, maxSteer);
}

// ====================================================================================

// ÄNDERN Sie die Funktion "monitorDirectionChange"
void monitorDirectionChange(float yaw) {
    float rectangleError = fmod(targetAngle - yaw + 540, 360) - 180;

    // Fix für 180-Grad-Drehung
    if (turnDirection == 1 && rectangleError < -90) rectangleError += 360;
    else if (turnDirection == -1 && rectangleError > 90) rectangleError -= 360;

    // PD-Controller (Phase 3.1: Extracted to helper function)
    skillSteer = calculatePDSteer(rectangleError, currentSettings.Kp, currentSettings.Kd, currentSettings.currentMaxSteer);

    if (ENABLE_DEBUG_SERIAL && (millis() - lastSerialUpdate >= 500)) {
        lastSerialUpdate = millis();
        DEBUG_PRINTF("Yaw: %.1f, Err: %.1f, Steer: %d\n", yaw, rectangleError, skillSteer);
    }

    if (abs(rectangleError) < PD_ERROR_THRESHOLD) {
        DEBUG_LOG("Target angle reached.");
        resetAll();
    }
}

// ÄNDERN Sie die Funktion "holdTheLine"
void holdTheLine(float yaw) {
    // Fehler ist die Abweichung vom Startwinkel (Phase 3.1: Using helper)
    float rectangleError = normalizeAngle(startYaw - yaw);

    // PD-Controller (Phase 3.1: Extracted to helper function)
    skillSteer = calculatePDSteer(rectangleError, currentSettings.Kp, currentSettings.Kd, currentSettings.currentMaxSteer);

    if (ENABLE_DEBUG_SERIAL && (millis() - lastSerialUpdate >= 500)) {
        lastSerialUpdate = millis();
        DEBUG_PRINTF("HoldLine | Yaw: %.1f, Dev: %.1f, Steer: %d\n", yaw, -rectangleError, skillSteer);
    }
}



void statusTask(void *pvParameters) {
    // Statische Variable für die Glättung
    static float smoothed_blade_mv = 0;

    for (;;) {
        // Lokale Kopie des Feedbacks mit Mutex-Schutz
        SerialFeedback safeFeedback;
        if (xSemaphoreTake(feedbackMutex, (TickType_t)5) == pdTRUE) {
            memcpy(&safeFeedback, &Feedback, sizeof(SerialFeedback));
            xSemaphoreGive(feedbackMutex);
        }
        // =========================================================
        // 1. SCHNELLE MESSUNG (Alle 50ms)
        // =========================================================
        
        // 1a. Spannung lesen (Millivolt am Pin 1)
        uint32_t raw_pin_mv = analogReadMilliVolts(BLADE_BATTERY_PIN);

        // 1b. Mit Faktor verrechnen
        float calculated_mv = (float)raw_pin_mv * currentSettings.bladeBatteryFactor;

        // 1c. INTELLIGENTE GLÄTTUNG (Optimiert für Stabilität)
        
        // FALL A: START-UP (Schnell)
        // Wenn der gespeicherte Wert noch unter 5V ist (System startet gerade),
        // übernehmen wir den neuen Wert sofort. Keine Wartezeit beim Einschalten!
        if (smoothed_blade_mv < 5000) {
             smoothed_blade_mv = calculated_mv;
        } 
        // FALL B: BETRIEB (Stabil & Träge)
        // Hier nutzen wir den Filter. 95% Alter Wert, 5% Neuer Wert.
        // Das bügelt Schwankungen durch Motorenstarts komplett glatt.
        else {
             smoothed_blade_mv = (smoothed_blade_mv * 0.95) + (calculated_mv * 0.05);
        }

        // 1d. Global speichern
        global_blade_voltage_mv = (int32_t)smoothed_blade_mv;

