Dolomonti/ESP32s3-Lawnmower/src/main.cpp
        /*
        // --- DEBUG AUSGABE (Alle 2 Sekunden im Monitor sichtbar) ---
        static unsigned long lastDebugPrint = 0;
        if (millis() - lastDebugPrint > 2000 && ENABLE_DEBUG_SERIAL) {
             lastDebugPrint = millis();
             debugPrintf("[StatusTask] Pin1 Raw: %d mV | Factor: %.2f | Calc Bat: %d mV\n", 
                           raw_pin_mv, currentSettings.bladeBatteryFactor, global_blade_voltage_mv);
        }
        */
        // -----------------------------------------------------------

        // Warte das Sende-Intervall ab
        vTaskDelay(statusSendInterval / portTICK_PERIOD_MS);  
        
        if (ws.count() > 0) {
            DynamicJsonDocument doc(512);
            doc["type"] = "status";
            doc["estop"] = skill8SafetyActive.load(); // Phase 2: Atomar lesen für JSON
            
            // --- DRIVE BATTERY (Hoverboard) ---
            if (corrected_batVoltage < 500) { 
                doc["battery"] = nullptr; 
            } else { 
                doc["battery"] = corrected_batVoltage; 
            }
            
            // --- DRIVE TEMP (Hoverboard) ---
            // Feedback ist z.B. 300 (30.0°C). Webseite teilt durch 100.
            // Wir senden mal 10 -> 3000 / 100 = 30.00
            if (safeFeedback.boardTemp == 0) { 
                doc["temp"] = nullptr; 
            } else { 
                doc["temp"] = safeFeedback.boardTemp * 10; 
            }
            
            // --- BLADE BATTERY (Zusatzakku) ---
            // Wir haben den Schwellwert auf 1000mV (1V) gesenkt, damit du was siehst.
            if (global_blade_voltage_mv < 1000) {
                doc["blade_battery"] = nullptr;
            } else {
                // Wir senden Centivolt an die Webseite
                // Bsp: 16348 mV / 10 = 1634. Webseite rechnet 1634 / 100 = 16.34 V
                doc["blade_battery"] = global_blade_voltage_mv / 10;
            }
            
            // Dummys für Sensoren, die wir (noch) nicht haben
            doc["battery_temp"] = 0;
            doc["blade_temp"] = 0; // Das erzeugt das "NN" oder "--" für Blade Temp

            // Sende Blade-Status (hilfreich für die Web-UI)
            doc["blade_state"] = (currentBladeState == BLADE_OFF) ? "off" : "work";
            String bladeHeightStr = "unknown";
            if (currentBladeHeight == BLADE_HEIGHT_DOWN) bladeHeightStr = "down";
            else if (currentBladeHeight == BLADE_HEIGHT_UP) bladeHeightStr = "up";
            doc["blade_height"] = bladeHeightStr;

            // --- SPEED CALCULATION (Moved to StatusTask to protect Serial Communication) ---
            // Calculate speed in km/h based on average RPM of both wheels
            
            // FIX: Right wheel is mounted mirrored, so its feedback is inverted (negative for forward)
            // We invert it here to get positive values for forward driving.
            int16_t speedR_corrected = -safeFeedback.speedR_meas;

            float avg_rpm = (safeFeedback.speedL_meas + speedR_corrected) / 2.0f;
            
            // Formula: kmh = (avg_rpm * 0.95m * 60) / 1000
            current_speed_kmh = (avg_rpm * 0.95f * 60.0f) / 1000.0f;
            
            // Calculate individual speeds
            float speedL_kmh = (Feedback.speedL_meas * 0.95f * 60.0f) / 1000.0f;
            float speedR_kmh = (speedR_corrected * 0.95f * 60.0f) / 1000.0f;

            doc["speed_kmh"] = current_speed_kmh;
            doc["speedL_kmh"] = speedL_kmh;
            doc["speedR_kmh"] = speedR_kmh;

            // Blade mode: off / standby / speed1 / speed2 / web_pwm
            String bladeMode = "off";
            if (currentBladeState == BLADE_OFF) {
                bladeMode = "off";
            } else if (currentBladeState == BLADE_CABLE_RESET) {
                bladeMode = "cable_reset";
            } else if (currentBladeState == BLADE_WORK) {
                if (current_blade_pwm == BLADE_ZERO_US) bladeMode = "standby";
                else if (current_blade_pwm == currentSettings.bladeWorkingSpeed) bladeMode = "speed1";
                else if (current_blade_pwm == currentSettings.bladeStage2Speed) bladeMode = "speed2";
                else bladeMode = "web_pwm";
            }
            doc["blade_mode"] = bladeMode;

            // Skills / Drive modes
            doc["hold_line"] = holdLine;
            doc["turn_active"] = skillActive.load(); // Phase 2: Atomar lesen für JSON
            // Provide detail which turn is active so the Web UI can highlight the correct button
            doc["turn_case"] = currentCase;      // 2 = 90°, 4 = 180°
            doc["turn_direction"] = turnDirection; // -1 = left, 1 = right, 0 = none
            doc["cable_reset"] = (currentBladeState == BLADE_CABLE_RESET);
            // stop_reset is the -20 command (Stop/Reset); we cannot know if it's active but include false for now
            doc["stop_reset"] = false;

            String jsonString;
            serializeJson(doc, jsonString);
            ws.textAll(jsonString); 
        }
    }
}

// Task 5.5: EEPROM Speicher-Task (asynchrones Speichern außerhalb des Web-Threads)
void nvsSaveTask(void *pvParameters) {
    // Phase 1.2: Asynchrones Speichern in NVS (mit Wear-Leveling)
    for (;;) {
        if (settingsNeedSave) {
            if (saveSettings()) {
                DEBUG_LOG("Settings saved successfully (async NVS)");
            } else {
                DEBUG_LOG("ERROR: Failed to save settings (async NVS)");
            }
            settingsNeedSave = false;
        }
        vTaskDelay(100 / portTICK_PERIOD_MS); // Prüfe alle 100ms
    }
}

extern const char webpage_part1[] PROGMEM;
extern const char webpage_part2[] PROGMEM;

void handleWebpage(AsyncWebServerRequest *request) {
    // Wir senden die Antwort "gestückelt" (Chunked Response)
    AsyncWebServerResponse *response = request->beginChunkedResponse("text/html", [](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
        
        // Gesamtlänge beider Teile
        size_t len1 = strlen_P(webpage_part1);
        size_t len2 = strlen_P(webpage_part2);
        size_t totalLen = len1 + len2;

        // Wenn wir alles gesendet haben, gib 0 zurück (Ende)
        if (index >= totalLen) {
            return 0;
        }

        // Berechne, wie viel wir in diesem "Chunk" senden können
        size_t bytesRemaining = totalLen - index;
        size_t bytesToSend = (bytesRemaining < maxLen) ? bytesRemaining : maxLen;

        // Daten kopieren
        for (size_t i = 0; i < bytesToSend; i++) {
            size_t currentPos = index + i;
            if (currentPos < len1) {
                // Wir sind noch im ersten Teil
                buffer[i] = pgm_read_byte(webpage_part1 + currentPos);
            } else {
                // Wir sind im zweiten Teil
                buffer[i] = pgm_read_byte(webpage_part2 + (currentPos - len1));
            }
        }
        return bytesToSend;
    });

    request->send(response);
}